# Brewfile — macOS package set. Provision with `brew bundle`.
# This is the macOS analog of SUSE_PACKAGES in init.sh.

# Core dev
brew "git"
brew "stow"
brew "neovim"
brew "tmux"
brew "wget"
brew "gnupg"

# Modern CLI / shell experience
brew "ripgrep"                      # rg
brew "fd"                           # fast find
brew "bat"                          # cat with wings
brew "eza"                          # modern ls
brew "fzf"                          # fuzzy finder
brew "zoxide"                       # smarter cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "zsh-completions"

# Testing / dev tooling
brew "bats-core"                    # bash test runner (briefing/ test suite)
